In [1]:
import warnings
warnings.filterwarnings(action='ignore') 

import pandas as pd
import numpy as np
import csv
import folium
import matplotlib.pyplot as plt
plt.rc('font',family='D2CodingLigature Nerd Font')

In [2]:
df1 = pd.DataFrame({'name': ['Jessica', 'Liam', 'Sophia', 'Ryan','Alex'],
                    'gender': ['F', 'M', 'F', 'M', 'F'],
                    'age': [21, 23, 20, 22, 20]})

df2 = pd.DataFrame({'name': ['Sophia', 'Liam', 'Ryan', 'Alex', 'Jessica'],
                    'department': ['computer science', 'mathematics', 'law',
                    'computer science', 'law']})

In [3]:
display(df1)
display(df2)

      name gender  age
0  Jessica      F   21
1     Liam      M   23
2   Sophia      F   20
3     Ryan      M   22
4     Alex      F   20

      name        department
0   Sophia  computer science
1     Liam       mathematics
2     Ryan               law
3     Alex  computer science
4  Jessica               law

In [ ]:
df3 = pd.merge(df1, df2, on='name')     # inner 방식
df3

      name gender  age        department
0  Jessica      F   21               law
1     Liam      M   23       mathematics
2   Sophia      F   20  computer science
3     Ryan      M   22               law
4     Alex      F   20  computer science

In [ ]:
df4 = pd.merge(df1, df2, on='name', how='outer')    # outer 방식
df4

## how = 'left'     df1 기준
## how = 'right'    df2 기준

      name gender  age        department
0     Alex      F   20  computer science
1  Jessica      F   21               law
2     Liam      M   23       mathematics
3     Ryan      M   22               law
4   Sophia      F   20  computer science

In [7]:
df5 = pd.DataFrame({'department': ['computer science', 'mathematics', 'law'],
                    'head of department': ['Steve', 'Emma', 'Carly']})
df5

         department head of department
0  computer science              Steve
1       mathematics               Emma
2               law              Carly

In [ ]:
df6 = pd.merge(df4, df5, on='department')
df6

      name gender  age        department head of department
0     Alex      F   20  computer science              Steve
1  Jessica      F   21               law              Carly
2     Liam      M   23       mathematics               Emma
3     Ryan      M   22               law              Carly
4   Sophia      F   20  computer science              Steve

In [9]:
df7 = df6.sort_values(['department', 'age'], ascending=False)
df7

      name gender  age        department head of department
2     Liam      M   23       mathematics               Emma
3     Ryan      M   22               law              Carly
1  Jessica      F   21               law              Carly
0     Alex      F   20  computer science              Steve
4   Sophia      F   20  computer science              Steve